var charArr =[
  "அ","ஆ","இ","ஈ","உ","ஊ","எ","ஏ","ஐ","ஒ","ஓ","ஔ","ஃ",
  "க","கா","கி","கீ","கு","கூ","கெ","கே","கை","கொ","கோ","கௌ","க்",
  "ங","ஙா","ஙி","ஙீ","ஙு","ஙூ","ஙெ","ஙே","ஙை","ஙொ","ஙோ","ஙௌ","ங்",
  "ச","சா","சி","சீ","சு","சூ","செ","சே","சை","சொ","சோ","சௌ","ச்",
  "ஞ","ஞா","ஞி","ஞீ","ஞு","ஞூ","ஞெ","ஞே","ஞை","ஞொ","ஞோ","ஞௌ","ஞ்",
  "ட","டா","டி","டீ","டு","டூ","டெ","டே","டை","டொ","டோ","டௌ","ட்",
  "ண","ணா","ணி","ணீ","ணு","ணூ","ணெ","ணே","ணை","ணொ","ணோ","ணௌ","ண்",
  "த","தா","தி","தீ","து","தூ","தெ","தே","தை","தொ","தோ","தௌ","த்",
  "ந","நா","நி","நீ","நு","நூ","நெ","நே","நை","நொ","நோ","நௌ","ந்",
  "ப","பா","பி","பீ","பு","பூ","பெ","பே","பை","பொ","போ","பௌ","ப்",
  "ம","மா","மி","மீ","மு","மூ","மெ","மே","மை","மொ","மோ","மௌ","ம்",
  "ய","யா","யி","யீ","யு","யூ","யெ","யே","யை","யொ","யோ","யௌ","ய்",
  "ர","ரா","ரி","ரீ","ரு","ரூ","ரெ","ரே","ரை","ரொ","ரோ","ரௌ","ர்",
  "ல","லா","லி","லீ","லு","லூ","லெ","லே","லை","லொ","லோ","லௌ","ல்",
  "வ","வா","வி","வீ","வு","வூ","வெ","வே","வை","ளொ","ளோ","ளௌ","வ்",
  "ழ","ழா","ழி","ழீ","ழு","ழூ","ழெ","ழே","ழை","வொ","வோ","வௌ","ழ்",
  "ள","ளா","ளி","ளீ","ளு","ளூ","ளெ","ளே","ளை","ழொ","ழோ","ழௌ","ள்",
  "ற","றா","றி","றீ","று","றூ","றெ","றே","றை","றொ","றோ","றௌ","ற்",
  "ன","னா","னி","னீ","னு","னூ","னெ","னே","னை","னொ","னோ","னௌ","ன்"];

 var flchars = [
   "ஜ","ஜா","ஜி","ஜீ","ஜு","ஜூ","ஜெ","ஜே","ஜை","ஜொ","ஜோ","ஜௌ","ஜ்",
   "ஷ","ஷா","ஷி","ஷீ","ஷு","ஷூ","ஷெ","ஷே","ஷை","ஷொ","ஷோ","ஷௌ","ஷ்",
   "ஸ","ஸா","ஸி","ஸீ","ஸு","ஸூ","ஸெ","ஸே","ஸை","ஸொ","ஸோ","ஸௌ","ஸ்",
   "ஹ","ஹா","ஹி","ஹீ","ஹு","ஹூ","ஹெ","ஹே","ஹை","ஹொ","ஹோ","ஹௌ","ஹ்",
   "க்ஷ","க்ஷா","க்ஷி","க்ஷீ","க்ஷு","க்ஷூ","க்ஷே","க்ஷை","க்ஷொ","க்ஷோ","க்ஷௌ","க்ஷ்"];
 
var charMap = {}

var getSuffix = function getSuffix(word) {
  var index = charArr.findIndex(function(ele) { return word.endsWith(ele); });
  return [charArr[index], index];
}

var inflectionMap = {
  "common": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து",
                "யில்", "யை", "க்கு", "யோடு", "யுடைய", "யால்", "யிடம்", "யிடமிருந்து", "யே", "யிலே", "யின்", "யிலிருந்து"],
  
  "க்": ["கில்", "கை", "கிற்கு", "கோடு", "குடைய", "கால்", "கிடம்", "கிடமிருந்து", "கே", "கிலிருந்து", "கின்", "கிலே"],
  "ங்": ["கில்", "கை", "கிற்கு", "கோடு", "குடைய", "கால்", "கிடம்", "கிடமிருந்து", "கே", "கிலிருந்து", "கின்", "கிலே"],
  "ச்": ["சின்", "சில்", "சிலே", "சை", "சிற்கு", "சோடு", "சுடைய", "சால்", "சிடம்", "சிடமிருந்து", "சே", "சிலிருந்து"],
  "ஞ்": ["சின்", "சில்", "சிலே", "சை", "சிற்கு", "சோடு", "சுடைய", "சால்", "சிடம்", "சிடமிருந்து", "சே", "சிலிருந்து"],
  "ட்": ["டின்", "டில்", "டிலே", "டை", "டிற்கு", "டோடு", "டுடைய", "டால்", "டிடம்", "டிடமிருந்து", "டே", "டிலிருந்து"],
  "ண்": ["ணின்", "ணில்", "ணிலே", "ணை", "ணிற்கு", "ணோடு", "ணுடைய", "ணால்", "ணிடம்", "ணிடமிருந்து", "ணே", "ணிலிருந்து"],
  "த்": ["தின்", "தில்", "திலே", "தை", "திற்கு", "தோடு", "துடைய", "தால்", "திடம்", "திடமிருந்து", "தே", "திலிருந்து"],
  "ந்": ["தின்", "தில்", "திலே", "தை", "திற்கு", "தோடு", "துடைய", "தால்", "திடம்", "திடமிருந்து", "தே", "திலிருந்து"],
  "ப்": ["பின்", "பில்", "பிலே", "பை", "பிற்கு", "போடு", "புடைய", "பால்", "பிடம்", "பிடமிருந்து", "பே", "பிலிருந்து"],
  "ம்": ["த்தின்", "த்தில்", "த்திலே", "த்தை", "த்திற்கு", "த்தோடு", "த்துடைய", "த்தால்", "த்திடம்", "த்திடமிருந்து", "த்தே", "த்திலிருந்து"],
  "ய்": ["யில்", "யை", "க்கு", "யோடு", "யுடைய", "யால்", "யிடம்", "யிடமிருந்து", "யே", "யிலே", "யின்", "யிலிருந்து"],
  "ர்": ["ரின்", "ரில்", "ரிலே", "ரை", "ருக்கு", "ரோடு", "ருடைய", "ரால்", "ரிடம்", "ரிடமிருந்து", "ரே", "ரிலிருந்து"],
  "ல்": ["லின்", "லில்", "லிலே", "லை", "லிற்கு", "லோடு", "லுடைய", "லால்", "லிடம்", "லிடமிருந்து", "லே", "லிருந்து"],
  "வ்": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "ழ்": ["ழில்", "ழின்", "ழிலே", "ழை", "ழிற்கு", "ழோடு", "ழுடைய", "ழாள்", "ழிடம்", "ழிடமிருந்து", "ழே", "ழிலிருந்து"],
  "ள்": ["ளில்", "ளின்", "ளிலே", "ளை", "ளிற்கு", "ளோடு", "ளுடைய", "ளாள்", "ளிடம்", "ளிடமிருந்து", "ளே", "ளிலிருந்து"],
  "ற்": ["றின்", "றில்", "றிலே", "றை", "றிற்கு", "றோடு", "றுடைய", "றால்", "றிடம்", "றிடமிருந்து", "றே", "றிலிருந்து"],
  
  "ன்": ["னின்", "னில்", "னிலே", "னை", "னிற்கு", "னோடு", "னுடைய", "னால்", "னிடம்", "னிடமிருந்து", "னே", "னிலிருந்து"],
  "கு": ["கில்", "கை", "கிற்கு", "கோடு", "குடைய", "கால்", "கிடம்", "கிடமிருந்து", "கே", "கிலிருந்து", "கின்", "கிலே", "வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "ஙு": ["கில்", "கை", "கிற்கு", "கோடு", "குடைய", "கால்", "கிடம்", "கிடமிருந்து", "கே", "கிலிருந்து", "கின்", "கிலே", "வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "சு": ["சின்", "சில்", "சிலே", "சை", "சிற்கு", "சோடு", "சுடைய", "சால்", "சிடம்", "சிடமிருந்து", "சே", "சிலிருந்து", "வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "ஞு": ["சின்", "சில்", "சிலே", "சை", "சிற்கு", "சோடு", "சுடைய", "சால்", "சிடம்", "சிடமிருந்து", "சே", "சிலிருந்து", "வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "டு": ["டின்", "டில்", "டிலே", "டை", "டிற்கு", "டோடு", "டுடைய", "டால்", "டிடம்", "டிடமிருந்து", "டே", "டிலிருந்து", "வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "ணு": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "து": ["தின்", "தில்", "திலே", "தை", "திற்கு", "தோடு", "துடைய", "தால்", "திடம்", "திடமிருந்து", "தே", "திலிருந்து", "வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "நு": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "பு": ["பின்", "பில்", "பிலே", "பை", "பிற்கு", "போடு", "புடைய", "பால்", "பிடம்", "பிடமிருந்து", "பே", "பிலிருந்து", "வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "மு": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "யு": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "ரு": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "லு": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "வு": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "ழு": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "ளு": ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "று": ["றின்", "றில்", "றிலே", "றை", "றிற்கு", "றோடு", "றுடைய", "றால்", "றிடம்", "றிடமிருந்து", "றே", "றிலிருந்து", "வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"],
  "னு" : ["வில்", "வை", "விற்கு", "வோடு", "வுடைய", "வால்", "விடம்", "விடமிருந்து", "வே", "விலே", "வின்", "விலிருந்து"]
}

var generateInflections = function (token) {
  var result = getSuffix(token);

  var suffix = result[0]
    , index = result[1];

  var commonIndexes = {"0": "அ", "1": "ஆ", "2": "இ", "3": "ஈ", "5": "ஊ", "6": "எ", "7": "ஏ", "8": "ஐ", "9": "ஒ", "10": "ஓ", "11": "ஔ"};

  var tokenInflections = [];
  
  if(index % 13 in commonIndexes) {
    tokenInflections = inflectionMap.common.map(function(ele) { return token + ele });
  }
  else if(suffix in inflectionMap) {
    tokenInflections = inflectionMap[suffix].map(function(ele) { return token + ele; });
    inflectionMap[suffix].map(function(ele) { tokenInflections.push(token.substr(0, token.length-suffix.length) + ele); });
  }
  return tokenInflections;
}